In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from conf import *

# set pandas shown columns to 50
pd.set_option('display.max_columns', 50)

### Push subjects data to db

In [2]:
subjects_df = pd.read_csv('./dataset/SUBJECTS.csv')
subjects_df.rename(columns={'id': 'user_id', 'ht': 'height', 'wt': 'weight'}, inplace=True)
# calculate age from dob
subjects_df['dob'] = pd.to_datetime(subjects_df['dob'])
subjects_df['age'] = (pd.to_datetime('today') - subjects_df['dob']).astype('<m8[Y]').astype(int)
subjects_df.head()

,user_id,subj_id,device_id,cohort_id,dropped,drop_type,rank,rank_date,pref,rtc_checkin_date,brpc_attempts,pop,mos,pebd,eas,dob,height,weight,area_code,married,city,state,hs_name,hs_city,hs_state,hs_grad_year,hs_sports,hs_clubs,college_name,college_city,college_state,college_grad_year,college_sports,college_clubs,hobbies,swimming_exp,workout_exp,DOR_Time,DOR_Activity,drop_date,age
0,1,88e86f98-15c0-4c99-9460-ec80876bbba1,19,1,False,Pass,SGT,2017-11-01,ALAT,NaN,1,ME,612,2014-06-09,2024-06-08,1994-09-29,73,192,81.0,N,SACRAMENTO,CA,PAUL M. DORMAN HS,MOORE,SC,2013.0,0,0,NaN,NaN,NaN,NaN,NaN,NaN,"GYM, EXPLORING",1.0,1.0,NaN,NaN,NaN,28
1,2,5704d0d5-44d7-4e75-b598-792e9debb6f0,1,1,False,Pass,HN,2015-03-24,NAV,20180318.0,2,NE,8404,2015-03-24,2021-03-24,1989-09-14,69,160,512.0,N,AUSTIN,TX,WESTLAKE HS,AUSTIN,TX,2008.0,0,0,TEXAS TECH UNIVERSTITY,LUBBOCK,TX,2013.0,0,0,NaN,1.0,1.0,NaN,NaN,NaN,33
2,3,693034d5-df06-463f-9146-9c26d3fee770,2,1,True,DOR,PFC,2017-11-27,MCT/HZ,20180403.0,1,ME,03XX,2017-11-27,2022-11-27,1994-06-17,69,155,714.0,N,ANAHEIM,CA,SAVANNA HS,ANAHEIM,CA,2013.0,4,0,CALIFORNIA STATE UNIVERSITY FULLERTON,FULLERTON,CA,0.0,0,0,"EXERCISING, COMIC BOOKS",1.0,1.0,15:00:00,WSA,2018-05-03,29
3,4,2aeff147-0b19-48bd-9f45-f9ffc3266c50,4,1,False,Pass,PFC,2017-11-06,UH,20180417.0,1,ME,313,2017-11-06,2022-11-06,1999-09-09,67,130,747.0,N,HOLLY RIDGE,NC,BONNEVILLE HS,IDAHO FALLS,ID,2017.0,"1, 2",NaN,NaN,NaN,NaN,NaN,NaN,NaN,"SURFING, FISHING",1.0,1.0,NaN,NaN,NaN,23
4,5,e662d2d7-9110-4df4-8b27-734bebcd09b2,5,1,True,DOR,PFC,2017-12-01,UH,20180327.0,1,ME,311,2017-09-05,2022-09-05,1999-05-24,65,145,559.0,N,SANGER,CA,SANGER HS,SANGER,CA,2017.0,"10, 13","6, 10",NaN,NaN,NaN,NaN,NaN,NaN,SWIMMING,2.0,1.0,13:30:00,Lunch,2018-05-02,24

In [3]:
# write df to database
db_connection_str = f'postgresql://{DB_USER}:{DB_PASS}@{DB_HOST}:{DB_PORT}/{DB_NAME}'
db_engine = create_engine(db_connection_str)
subjects_df.to_sql('subjects', con=db_engine, if_exists='replace', index=False)

115

### Process band heart-rate data

In [4]:
hrates_raw_df = pd.read_csv('./dataset/BAND_Heart-Rate.csv')
hrates_raw_df.head()

   id  value unit response_date                   end_date
0   1    107  bpm    2018-04-27  2018-04-26 18:26:04 +0000
1   1    106  bpm    2018-04-27  2018-04-26 18:26:06 +0000
2   1     77  bpm    2018-04-27  2018-04-26 18:54:59 +0000
3   1     75  bpm    2018-04-27  2018-04-26 18:56:29 +0000
4   1     73  bpm    2018-04-27  2018-04-26 19:02:51 +0000

In [5]:
hrates_df = hrates_raw_df[['id', 'end_date', 'value']].copy().rename(columns={'id': 'user_id', 'end_date': 'timestamp'})
hrates_df = hrates_df[hrates_df['value']>0]
hrates_df['timestamp'] = pd.to_datetime(hrates_df['timestamp'])
# sort by user_id and timestamp
hrates_df.sort_values(by=['user_id', 'timestamp'], inplace=True)
hrates_df.head()

   user_id                 timestamp  value
0        1 2018-04-26 18:26:04+00:00    107
1        1 2018-04-26 18:26:06+00:00    106
2        1 2018-04-26 18:54:59+00:00     77
3        1 2018-04-26 18:56:29+00:00     75
4        1 2018-04-26 19:02:51+00:00     73

In [16]:
# resample values by 1 minute
hrates_dt_df = hrates_df.set_index('timestamp')
# hrates_resampled = hrates_dt_df.groupby('user_id')['value'].resample('10T').mean().interpolate(method='linear').to_frame().reset_index()
hrates_resampled = hrates_dt_df.groupby('user_id')['value'].resample('1T').mean().dropna().to_frame().reset_index()
hrates_resampled.to_sql('heart_rates', con=db_engine, if_exists='replace', index=False)

656

In [17]:
# what is the most frequent timestamp in hrates_resampled?
hrates_resampled.timestamp.value_counts()['2018-04-30 8:20:00']

36

### Process band active energy

In [45]:
aenergy_raw_df = pd.read_csv('./dataset/BAND_Active-Energy.csv')
aenergy_raw_df

       id        value  unit response_date                       end_date
0       1   176.578000  kcal    2018-04-27  2018-04-27T17:17:34.649-07:00
1       1   152.298000  kcal    2018-05-23  2018-05-23T17:23:43.039-07:00
2       1  1892.518000  kcal    2018-05-25  2018-05-25T15:50:30.620-07:00
3       1   904.485061  kcal    2018-05-31  2018-05-31T12:12:32.216-07:00
4       1  1552.391939  kcal    2018-05-31  2018-05-31T12:12:32.216-07:00
...   ...          ...   ...           ...                            ...
2582  113  1730.838906  kcal    2018-07-31  2018-07-31T17:42:28.605-07:00
2583  113  1616.340000  kcal    2018-07-31  2018-07-31T17:42:28.605-07:00
2584  111   214.923000  kcal    2018-07-20  2018-07-20T16:39:31.255-07:00
2585   82  1807.089000  kcal    2018-07-19  2018-07-19T17:20:37.543-07:00
2586   83     0.000000  kcal    2018-07-19  2018-07-19T18:28:27.579-07:00

[2587 rows x 5 columns]

In [53]:
aenergy_df = aenergy_raw_df[['id', 'end_date', 'value']].copy().rename(columns={'id': 'user_id', 'end_date': 'timestamp'})
aenergy_df = aenergy_df[aenergy_df['value']>0]
aenergy_df['timestamp'] = pd.to_datetime(aenergy_df['timestamp'])
# sort by user_id and timestamp
aenergy_df.sort_values(by=['user_id', 'timestamp'], inplace=True)
aenergy_df.head()

    user_id                        timestamp        value
0         1 2018-04-27 17:17:34.649000-07:00   176.578000
5         1 2018-04-30 10:59:49.696000-07:00   611.059203
22        1 2018-05-01 17:52:48.615000-07:00  2180.596000
41        1 2018-05-02 17:52:48.609000-07:00  2180.596000
19        1 2018-05-03 17:52:48.600000-07:00  2180.596000

In [56]:
aenergy_df.set_index('timestamp').groupby('user_id')['value'].resample('1T').mean().to_frame().reset_index()

         user_id                 timestamp    value
0              1 2018-04-27 17:17:00-07:00  176.578
1              1 2018-04-27 17:18:00-07:00      NaN
2              1 2018-04-27 17:19:00-07:00      NaN
3              1 2018-04-27 17:20:00-07:00      NaN
4              1 2018-04-27 17:21:00-07:00      NaN
...          ...                       ...      ...
3216303      115 2018-08-17 08:40:00-07:00      NaN
3216304      115 2018-08-17 08:41:00-07:00      NaN
3216305      115 2018-08-17 08:42:00-07:00      NaN
3216306      115 2018-08-17 08:43:00-07:00      NaN
3216307      115 2018-08-17 08:44:00-07:00  153.250

[3216308 rows x 3 columns]